###################################################################

# Created by write_sdc on Sat Feb 12 19:35:21 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {instruction_decode[31]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[30]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[29]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[28]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[27]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[26]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[25]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[24]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[23]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[22]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[21]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[20]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[19]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[18]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[17]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[16]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[15]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[14]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[13]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[12]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[11]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[10]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[9]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[8]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[7]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[6]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[5]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[4]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[3]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[2]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[1]}]
set_load -pin_load 3.40189 [get_ports {instruction_decode[0]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[31]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[30]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[29]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[28]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[27]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[26]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[25]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[24]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[23]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[22]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[21]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[20]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[19]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[18]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[17]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[16]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[15]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[14]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[13]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[12]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[11]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[10]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[9]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[8]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[7]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[6]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[5]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[4]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[3]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[2]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[1]}]
set_load -pin_load 3.40189 [get_ports {instruction_execute[0]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[31]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[30]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[29]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[28]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[27]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[26]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[25]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[24]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[23]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[22]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[21]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[20]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[19]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[18]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[17]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[16]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[15]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[14]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[13]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[12]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[11]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[10]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[9]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[8]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[7]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[6]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[5]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[4]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[3]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[2]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[1]}]
set_load -pin_load 3.40189 [get_ports {instruction_mem_adr[0]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[31]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[30]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[29]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[28]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[27]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[26]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[25]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[24]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[23]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[22]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[21]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[20]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[19]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[18]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[17]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[16]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[15]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[14]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[13]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[12]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[11]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[10]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[9]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[8]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[7]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[6]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[5]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[4]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[3]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[2]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[1]}]
set_load -pin_load 3.40189 [get_ports {write_data_mem[0]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[31]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[30]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[29]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[28]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[27]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[26]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[25]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[24]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[23]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[22]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[21]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[20]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[19]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[18]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[17]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[16]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[15]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[14]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[13]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[12]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[11]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[10]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[9]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[8]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[7]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[6]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[5]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[4]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[3]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[2]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[1]}]
set_load -pin_load 3.40189 [get_ports {data_mem_adr[0]}]
set_load -pin_load 3.40189 [get_ports MemWrite]
set_load -pin_load 3.40189 [get_ports MemRead]
create_clock [get_ports clock]  -name MY_CLK  -period 3.2  -waveform {0 1.6}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports reset]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_fetch[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {read_data_mem[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_decode[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_execute[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_mem_adr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {write_data_mem[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_adr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemWrite]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemRead]
